InformationRegisters/ТК_Скидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_Скидки</Name>
			<Comment>Сведения о скидках</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Comment>Значение скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВычисления</Name>
					<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагВытеснения</Name>
					<Comment>Флаг вытеснения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяСуммаПодарка</Name>
					<Comment>Максимальная сумма на которую можно сделать подарок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланАкционныхДневныхПродаж</Name>
					<Comment>Планируемые продажи за 1 день в периоде проведения Акции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассификаторПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторПродаж</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоДействия</Name>
					<Comment>Время начала действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецДействия</Name>
					<Comment>Время окончания действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДниНедели</Name>
					<Comment>Дни недели, когда действительна скидка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоПодарок</Name>
					<Comment>Истина, если скидка является подарком. Ложь, в противном случае</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Comment>Карта, на которую назначается скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаНакопления</Name>
					<Comment>Сумма накопительная, применяется совместно с дисконтной картой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалОбслуживания</Name>
					<Comment>Зал/Склад/Отдел в котором действует данная скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаСтроки</Name>
					<Comment>Сумма, начиная с которой скидка имеет действие</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаЧека</Name>
					<Comment>Сумма, начиная с которой скидка имеет действие</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество, начиная с которого предоставляется скидка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Comment>Правило расчета скидки по количеству</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаРасчетаСкидкиПоКоличеству</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Comment>Скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТК_ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>37</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КоэффициентНабора</Name>
					<Comment>Количество товара, на который будет назначаться скидка </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ТК_Скидки/Ext/Module.bsl
//Регистр Скидки
Процедура ПодготовитьСкидки(Запрос, ДополнительныеСвойства) Экспорт
	
	
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ТорговаяПлощадка", Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки"));
	ТаблицаДвижения.Колонки.Добавить("Объект",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("НачалоДействия");
	ТаблицаДвижения.Колонки.Добавить("КонецДействия");
	ТаблицаДвижения.Колонки.Добавить("ДниНедели");
	ТаблицаДвижения.Колонки.Добавить("ЭтоПодарок");
	ТаблицаДвижения.Колонки.Добавить("ДисконтнаяКарта",Новый ОписаниеТипов("СправочникСсылка.Карточки"));
	ТаблицаДвижения.Колонки.Добавить("СуммаНакопления",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаСтроки",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаЧека",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("Правило",Новый ОписаниеТипов("ПеречислениеСсылка.ПравилаРасчетаСкидкиПоКоличеству"));
	ТаблицаДвижения.Колонки.Добавить("Скидка",Новый ОписаниеТипов("СправочникСсылка.ТК_ТипыСкидок"));
	ТаблицаДвижения.Колонки.Добавить("Порядок");
	ТаблицаДвижения.Колонки.Добавить("КоэффициентНабора",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	
	ТаблицаДвижения.Колонки.Добавить("ЗначениеСкидки",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("Действует");
	ТаблицаДвижения.Колонки.Добавить("СпособВычисления",Новый ОписаниеТипов("ПеречислениеСсылка.СкидкиСпособВычисления"));
	ТаблицаДвижения.Колонки.Добавить("ФлагВытеснения");
	
	ТаблицаДвижения.Колонки.Добавить("МаксимальнаяСуммаПодарка",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ПланАкционныхДневныхПродаж",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	
	ТаблицаДвижения.Колонки.Добавить("Наименование");
	ТаблицаДвижения.Колонки.Добавить("КлассификаторПродаж",Новый ОписаниеТипов("СправочникСсылка.КлассификаторПродаж"));

	
	Запрос.Текст ="ВЫБРАТЬ
	              |	ВТ_Скидки.ФлагВытеснения КАК ФлагВытеснения,
	              |	ВТ_Скидки.ЗначениеСкидки КАК ЗначениеСкидки,
	              |	ВТ_Скидки.СпособВычисления КАК СпособВычисления,
	              |	ВТ_Скидки.Номенклатура КАК Объект,
	              |	ВТ_Скидки.Количество КАК Количество,
	              |	ВТ_Скидки.КоэффициентНабора КАК КоэффициентНабора,
	              |	ВТ_Скидки.Правило КАК Правило,
	              |	ВТ_Скидки.СуммаЧека КАК СуммаЧека,
	              |	ВТ_Скидки.СуммаСтроки КАК СуммаСтроки,
	              |	ВТ_Скидки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	              |	ВТ_Скидки.СуммаНакопления КАК СуммаНакопления,
	              |	ВТ_Скидки.НачалоДействия КАК НачалоДействия,
	              |	ВТ_Скидки.КонецДействия КАК КонецДействия,
	              |	ВТ_Скидки.ДниНедели КАК ДниНедели,
	              |	ВТ_Скидки.МаксимальнаяСуммаПодарка КАК МаксимальнаяСуммаПодарка,
	              |	ВТ_ТорговыеПлощадки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	              |	ВТ_Скидки.НомерДокумента КАК НомерДокумента,
				  |	ВТ_Скидки.КлассификаторПродаж КАК КлассификаторПродаж,
	              |	ВТ_Скидки.Скидка КАК Скидка
	              |ИЗ
	              |	ВТ_Скидки КАК ВТ_Скидки,
	              |	ВТ_ТорговыеПлощадки КАК ВТ_ТорговыеПлощадки";
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДатаДокумента  = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	СкидкаДействует = Ложь;
	
	Если ХозОперация = Справочники.ХозОперации.УстановкаСкидки Тогда
		СкидкаДействует = Истина;
	КонецЕсли;
	
		
	Пока Выборка.Следующий() Цикл 
		 НоваяЗапись = ТаблицаДвижения.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка);
		 НоваяЗапись.Действует = СкидкаДействует;
		 ВремяОкончания = Формат(Окр((Дата("21200101") - Выборка.КонецДействия) / 86400, 0), "ЧГ=0");
		 Пока СтрДлина(ВремяОкончания) < 5 Цикл
			 ВремяОкончания = "0" + ВремяОкончания;	
		 КонецЦикла;
		НоваяЗапись.Порядок				= Формат(Выборка.НачалоДействия, "ДФ=ггггММдд") + ВремяОкончания + Формат(ДатаДокумента, "ДФ=ггггММддЧЧммсс") + СокрЛП(Выборка.НомерДокумента);

	КонецЦикла;
	
		
		
	ТаблицаДвижения.ЗаполнитьЗначения(ДатаДокумента,"Период");	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТК_Скидки",ТаблицаДвижения);	
	
КонецПроцедуры



// Процедура формирует движения по РС "Скидки"
// Параметры: 
// 		ДополнительныеСвойства - Структура
//   	Движения - Коллекция движений
//   	Отказ - Булево
Процедура ОтразитьСкидки(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТК_Скидки;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияТК_Скидки = Движения.ТК_Скидки;
	ДвиженияТК_Скидки.Записывать = Истина;
	//
	ДвиженияТК_Скидки.Загрузить(Таблица);
	
КонецПроцедуры // ОтразитьЦеныНоменклатуры()
